Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This was likely to occur only if another keyboard hook was installed more recently than the script's own hook, since in that case the OS would not update key state until the other hook's thread has resumed and returned.
ja: この現象は、他のキーボードフックがスクリプト自身のフックよりも最近にインストールされた場合にのみ発生する可能性がある。その場合、他のフックのスレッドが再開して戻るまで、OSはキーの状態を更新しないからだ。

source: This was originally done to work around a bug in some versions of Windows XP, where BlockInput blocked the artificial Alt event.
ja: これはもともと、Windows XPの一部のバージョンで、BlockInputが人工的なAltイベントをブロックしてしまうというバグを回避するために行われたものです。

source: This was previously achieved by registering each AutoHotkey executable as a host app (IsHostApp), but this approach has limitations, and becomes less manageable when multiple versions can be installed.
ja: これまでは、各AutoHotkey実行ファイルをホストアプリ（IsHostApp）として登録することで実現していましたが、この方法には限界があり、複数のバージョンをインストールできるようになると管理しにくくなります。

source: This was removed as script files are not expected to have the .ini extension.
ja: スクリプトファイルには.iniという拡張子は期待できないため、これを削除しました。

source: This wasn't necessary with Notepad, but Notepad is an exception to the general rule.
ja: これはメモ帳では必要なかったのですが、メモ帳は一般的な例外です。

source: This way you will only monitor this message.
ja: こうすることで、このメッセージだけを監視することができる。

source: This will also omit the minimize, maximize, and close buttons in the title bar.
ja: これにより、タイトルバーの最小化、最大化、および閉じるボタンも省略されます。

source: This will be both top and bottom when used with TBS_HORZ or both left and right if used with TBS_VERT.
ja: TBS_HORZと併用する場合は上下両方、TBS_VERTと併用する場合は左右両方となる。

source: This will open the Startup folder for the current user.
ja: これにより、現在のユーザーのスタートアップフォルダが開かれます。

source: This window style is ignored unless the TCS_MULTILINE style is also specified.
ja: TCS_MULTILINEスタイルも指定されていない限り、このウィンドウ・スタイルは無視される。

source: This would apply to WStr instead of AStr if AutoHotkey is compiled for ANSI, but official v2 releases are only ever compiled for Unicode.
ja: AutoHotkeyがANSI用にコンパイルされている場合は、AStrではなくWStrに適用されますが、公式v2リリースはUnicode用にしかコンパイルされません。

source: This would be not the case if the #InputLevel directives are omitted or commented out.
ja: これは、#InputLevelディレクティブが省略されたり、コメントアウトされたりしている場合には当てはまらないでしょう。

source: This would most commonly be used with COM events (ComObjConnect).
ja: これは、COMイベント（ComObjConnect）で最も一般的に使用されるでしょう。

source: This would normally be done to prevent Send from triggering the system "lock workstation" hotkey (Win+L).
ja: これは通常、Sendがシステムの「ワークステーションをロック」ホットキー（Win+L）をトリガーするのを防ぐために行われるものです。

source: This would result in multiple instances of the script starting.
ja: このため、スクリプトが複数回起動することになります。

source: This would typically indicate that the variable's capacity was insufficient.
ja: これは通常、変数の容量が不足していることを意味します。

source: This would usually not be passed directly, as in IsSetRef(&MyVar), but indirectly, such as to check a parameter containing a VarRef prior to dereferencing it.
ja: これは通常、IsSetRef(&MyVar)のように直接渡されるのではなく、VarRefを含むパラメータを再参照する前にチェックするような間接的なものである。

source: This, for some reason crosses some people's minds.
ja: このことは、なぜか一部の人々の心を横切っている。

source: Those are a bit advanced and are covered more in-depth here:
ja: これらは少し高度なので、こちらで詳しく説明します：

source: Those are a bit advanced and are covered more in-depth here: The WinTitle Parameter & the Last Found Window.
ja: これらは少し高度なので、こちらで詳しく説明します：WinTitleパラメータと最後に見つかったウィンドウ。

source: Though it may be elaborate, a ListView's basic features are easy to use.
ja: 凝った作りになっていますが、ListViewの基本的な機能は簡単に使うことができます。

source: Thread - Syntax & Usage | AutoHotkey v2
ja: Thread - 構文と使用法｜AutoHotkey v2

source: Thread Interruptibility
ja: スレッドの中断可能性

source: Thread Priority
ja: スレッドの優先順位

source: Threads
ja: スレッド

source: Threads - Behaviour & Priority | AutoHotkey v2
ja: スレッド - 動作と優先順位｜AutoHotkey v2

source: Threads which start out uninterruptible now remain so until at least one line has executed, even if the uninterruptible timeout expires first (such as if the system suspends the process immediately after the thread starts in order to give CPU time to another process).
ja: スレッドが中断されずにスタートした場合、中断されないタイムアウトが先に切れても、少なくとも1行が実行されるまで中断されないようになりました（例えば、スレッドがスタートした直後に、他のプロセスにCPU時間を与えるために、システムがプロセスを中断した場合）。

source: Throughout the documentation, you will see these two symbols ([ and ]) surrounding code in the yellow syntax box at the top of almost all pages.
ja: この2つの記号（[と]）は、ほとんどのページの上部にある黄色い構文ボックスでコードを囲んでいます。

source: Throughout this documentation, some common words are used in ways that might not be obvious to someone without prior experience.
ja: この文書では、一般的な単語が、経験のない人にはわからないように使われていることがあります。

source: Throughout this tutorial you will see a lot of text and a lot of code.
ja: このチュートリアルでは、たくさんのテキストとたくさんのコードを見ることになるでしょう。

source: Throw - Syntax & Usage | AutoHotkey v2
ja: Throw - 構文と使用法｜AutoHotkey v2

source: Throw a MethodError.
ja: MethodErrorをスローします。

source: Throw a PropertyError.
ja: PropertyErrorをスローします。

source: Throw an IndexError if Index is zero or out of range.
ja: Indexが0または範囲外の場合、IndexErrorを投げる。

source: Throw an UnsetItemError.
ja: UnsetItemErrorを投げる。

source: Thus, a delay of 0 produces an actual delay between 0 and 20 ms (or more), depending on the number of needy processes (if there are no needy processes, there will be no delay at all).
ja: したがって、遅延が0の場合、実際の遅延は0～20ms（またはそれ以上）となり、必要とされるプロセスの数に依存する（必要とされるプロセスがない場合、遅延はまったく発生しない）。

source: Thus, if the user happens to type something during a SendPlay, those keystrokes are postponed until afterward.
ja: そのため、SendPlay中にユーザーが何かを入力することがあっても、そのキー入力はその後まで延期されます。

source: Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Program.
ja: 従って、本節の意図は、あなたによって完全に書かれた著作物に対する権利を主張したり、あなたの権利に異議を唱えたりすることではなく、むしろ、『プログラム』に基づく派生的あるいは集合的な著作物の頒布を管理する権利を行使することにあります。

source: Thus, it is usually unnecessary to follow WinActivate with WinWaitActive or if not WinActive(...).
ja: したがって、通常WinActivateの後にWinWaitActiveや if not WinActive(...)でなければWinActivateを続ける必要はない。

source: Thus, it is usually unnecessary to follow it with the WinWaitActive function.
ja: したがって、WinWaitActive関数でフォローする必要はない。

source: Thus, to have a different icon, change the tray icon before creating the window.
ja: したがって、別のアイコンを持つには、ウィンドウを作成する前にトレイアイコンを変更します。

source: Thus, to raise a literal negative number to a power, enclose it in parentheses such as (-2)**2.
ja: したがって、リテラルで負の数を累乗するには、(-2)**2のように括弧で囲む。

source: Thus, using text1`n`ntext2 would create a blank line between text1 and text2.
ja: したがって、text1`n`ntext2を使用すると、text1とtext2の間に空白行ができる。

source: Thus, when the subroutine finishes, it must wait for the next auto-repeat keypress to come in, which might take 50ms or more due to being caught in between keystrokes of the auto-repeat cycle.
ja: そのため、サブルーチンが終了すると、次のオートリピートキー入力が来るのを待たなければならず、オートリピートサイクルのキー入力の間に挟まれるため、50ms以上かかる場合があります。

source: Thus, when the subroutine finishes, it must wait for the next auto-repeat keypress to come in, which might take 50 ms or more due to being caught in between keystrokes of the auto-repeat cycle.
ja: そのため、サブルーチンが終了すると、次のオートリピートキー入力が来るのを待たなければならず、オートリピートサイクルのキー入力の間に挟まれるため、50 ms以上かかる場合があります。

source: Time Formats (case sensitive)
ja: タイムフォーマット（大文字・小文字を区別します）

source: Time Formats (case-sensitive)
ja: 時刻の形式（大文字・小文字は区別されます）

source: Time in milliseconds.
ja: ミリ秒単位の時間。

source: Time options.
ja: 時間の選択肢がある。

source: Time representation for the current user's locale, such as 5:26 PM
ja: 現在のユーザーのロケールでの時間表現（例：5:26 PM）

source: Timeout (e.g. T3).
ja: タイムアウト（例：T3）。

source: Timeout (that is, the word "timeout" is returned if the message box timed out)
ja: Timeout（メッセージボックスがタイムアウトした場合、「timeout」という単語が返されます）

source: Timers are useful because they run asynchronously, meaning that they will run at the specified frequency (interval) even when the script is waiting for a window, displaying a dialog, or busy with another task.
ja: タイマーは非同期で実行されるため、スクリプトがウィンドウを待っていたり、ダイアログを表示していたり、他のタスクで忙しかったりしても、指定した頻度（間隔）で実行されるため便利です。

source: Timing and delays
ja: タイミングと遅延

source: Tip: Try-Catch can be used to test for the existence of a hotkey variant.
ja: ヒント：Try-Catch は、ホットキーのバリアントが存在するかどうかをテストするために使用することができます。

source: Tips relating to the above example:
ja: 上記の例に関連するヒント：

source: Title Expression
ja: タイトル表現

source: Title Matching
ja: タイトルマッチング

source: To suspend, pause or reload another script, replace the last line above with one of these:
ja: 他のスクリプトを中断、一時停止、再読み込みするには、上記の最後の行を次のいずれかに置き換えてください：

source: To initialize a variable is to assign it a starting value.
ja: 変数を初期化するとは、その変数に開始値を割り当てることです。

source: To Hide the Window
ja: ウィンドウを隠すには

source: To access a remote registry, prepend the computer name and a backslash, as in this example:
ja: リモートレジストリにアクセスするには、この例のように、コンピュータ名の前にバックスラッシュを付けます：

source: To access a remote registry, prepend the computer name and a backslash, e.g. "\\workstation01\HKLM".
ja: リモートレジストリにアクセスするには、"\\workstation01\HKLM"のようにコンピューター名とバックスラッシュを前に追加してください。

source: To access a remote registry, prepend the computer name and a slash, as in this example:
ja: リモートレジストリにアクセスするには、この例のように、コンピュータ名の前にスラッシュを付けます：

source: To access an instance variable (even within a method), always specify the target object; for example, this.InstanceVar.
ja: インスタンス変数にアクセスするには（メソッド内であっても）、例えば、this.InstanceVarのようにします。

source: To access the items/rows individually, use a parsing loop as in example #1.
ja: 項目や行に個別にアクセスするには、例1.のような解析ループを使用します。

source: To achieve a shorter delay, see Examples.
ja: ディレイを短くするには、例を参照。

source: To activate this mode, hold down CapsLock or the middle mouse button while clicking, then drag the window to a new position.
ja: このモードを有効にするには、CapsLockまたはマウスの中ボタンを押しながらクリックし、ウィンドウを新しい位置までドラッグする。

source: To add a menu separator line, omit all three parameters.
ja: メニューの区切り線を追加する場合は、3つのパラメータをすべて省略します。

source: To add additional scripts, see the AddResource compiler directive.
ja: スクリプトを追加するには、AddResourceコンパイラー指令を参照してください。

source: To add an option, a plus sign is permitted but not required.
ja: オプションを追加する場合は、プラス記号を使用することができますが、必須ではありません。

source: To add further confusion, some functions scale coordinates based on which screen the script's last active window was displayed on.
ja: さらに混乱を招くことに、いくつかの関数は、スクリプトの最後にアクティブになったウィンドウがどのスクリーンに表示されていたかに基づいて座標をスケーリングする。

source: To add more than one ImageList to a ListView, call the SetImageList method a second time, specifying the ImageList ID of the second list.
ja: ListViewに複数のImageListを追加するには、2つ目のリストのImageList IDを指定して、SetImageListメソッドを2回呼び出します。

source: To add more than one ImageList to a ListView, call the SetImageList method a second time, specifying the ImageListID of the second list.
ja: ListViewに複数のImageListを追加するには、2つ目のリストのImageListIDを指定して、SetImageListメソッドを2回呼び出します。

source: To add new keys and values
ja: 新しいキーと値を追加する

source: To add new keys and values:
ja: 新しいキーと値を追加する：

source: To add or subtract a certain number of seconds, minutes, hours, or days from a timestamp, use DateAdd (subtraction is achieved by adding a negative number).
ja: タイムスタンプから秒、分、時間、日数を加算または減算するには、DateAddを使用します（減算は負の数を加算することで実現します）。

source: To additionally make the visible part of the window partially transparent, append a space (not a comma) followed by the transparency level (0-255).
ja: さらにウィンドウの可視部分を部分的に透明にするには、スペース（カンマではない）の後に透明度（0～255）を追加してください。

source: To additionally remove the border and title bar from a window with a transparent background, use the following:
ja: 背景が透明なウィンドウから、ボーダーとタイトルバーを追加で削除するには、次のようにします：

source: To additionally remove the border and title bar from a window with a transparent background, use the following: MyGui.Opt("-Caption")
ja: 背景が透明なウィンドウから、ボーダーとタイトルバーを追加で削除するには、次のようにします：MyGui.Opt("-Caption")

source: To adjust the value by a relative amount, use the operators +=, -=, ++ or -- instead of :=.
ja: 相対的に値を調整する場合は、:=の代わりに演算子+=、-=、++、--を使用します。

source: To alleviate this, keep the size of the area to a minimum.
ja: これを緩和するために、面積を最小限に抑えます。

source: To allow a hotkey to be called explicitly, specify funcName(ThisHotkey) between the :: and { - this can also be done in v1.1.20+, but now there is a parameter.
ja: ホットキーを明示的に呼び出すには、::と{の間にfuncName(ThisHotkey)を指定します - これは v1.1.20+ でも行えますが、現在はパラメータがあります。

source: To allow access to the processed .exe file, specify the special variable A_WorkFileName as a quoted parameter, such as "%A_WorkFileName%".
ja: 処理された.exeファイルへのアクセスを許可するには、"%A_WorkFileName%"のように、引用符で囲まれたパラメータとして特殊変数A_WorkFileNameを指定する。

source: To allow the method to accept a varying number of variables, declare optional parameters.
ja: メソッドが様々な数の変数を受け入れることができるようにするには、オプションのパラメータを宣言します。

source: To always include the prefix, use 0x{:x} or similar.
ja: 常にプレフィックスを含むようにするには、0x{:x}などを使用します。

source: To arrange the fields in a different order prior to parsing, use the Sort function.
ja: 解析前にフィールドを別の順序で並べるには、ソート機能を使用します。

source: To arrange the fields in a different order prior to splitting them, use the Sort function.
ja: フィールドを分割する前に別の順序で並べるには、ソート機能を使用します。

source: To arrange the filenames in alphabetical order, use the Sort function.
ja: ファイル名をアルファベット順に並べるには、「ソート」機能を使います。

source: To assign Unicode text to the clipboard, use a regular assignment.
ja: Unicodeのテキストをクリップボードに割り当てるには、通常の割り当てを使用します。

source: To assign a value to a variable, use the := assignment operator, as in MyVar := "Some text".
ja: MyVar := "Some text"のように、変数に値を代入するには、:= 代入演算子を使用します。

source: To assign to a class variable anywhere else, always specify the class object; for example, ClassName.ClassVar := Value.
ja: 例えば、ClassName.ClassVar := Valueのようにします。

source: To attach the debugger to a script which is already running, send it a message as shown below:
ja: すでに実行中のスクリプトにデバッガーをアタッチするには、以下のようにメッセージを送る：

source: To avoid being interrupted by itself (or any other thread), a callback may use Critical as its first line.
ja: 自分自身（あるいは他のスレッド）によって中断されるのを避けるために、コールバックはその最初の行としてCriticalを使用することができます。

source: To avoid confusion, the string functions listed above throw an exception if they are given a pure number.
ja: 混乱を避けるため、上記の文字列関数は、純粋な数値が与えられると例外を発生させます。

source: To avoid enabling the maximize button, specify +Resize -MaximizeBox.
ja: 最大化ボタンを有効にしない場合は、+Resize -MaximizeBoxを指定します。

source: To avoid inconsistency when two variables are specified, OwnProps skips over own properties that have only a Call accessor function.
ja: 2つの変数が指定された場合の矛盾を避けるため、OwnPropsはCallアクセサー関数のみを持つ自身のプロパティをスキップする。

source: To avoid processing hidden, system, and/or read-only files, use something like the following inside the loop:
ja: 隠しファイル、システムファイル、読み取り専用ファイルの処理を避けるために、ループ内で以下のように使用します：

source: To avoid repeating the variable name, you can both assign the result to a variable and check that it is non-zero (true) at the same time:
ja: 変数名の繰り返しを避けるために、結果を変数に代入し、それがゼロでないことを確認する両方が可能です(真)を同時に使用することができます：

source: To avoid that, use #NoTrayIcon instead.
ja: それを避けるために、代わりに#NoTrayIconを使用します。

source: To avoid these interruptions, temporarily disable such functions.
ja: このような中断を避けるには、このような機能を一時的に無効にしてください。

source: To avoid this in v2.0, add the RAW option or use FileOpen instead.
ja: v2.0ではこれを避けるため、RAWオプションを追加するか、代わりにFileOpenを使用します。

source: To avoid this, a script may configure Numpad0 to perform a new action such as one of the following:
ja: これを避けるために、スクリプトでNumpad0に次のような新しいアクションを実行させるように設定することができる：

source: To avoid this, add the $ prefix to the hotkey definition (e.g. $^c::) so that the hotkey cannot be triggered by the Send function.
ja: これを避けるには、ホットキーの定義に$ prefixを付け（例えば、$^c::）、送信機能でホットキーをトリガーできないようにします。

source: To avoid this, call IsLabel() beforehand.
ja: これを避けるには、あらかじめIsLabel()を呼び出しておきます。

source: To avoid this, it might be possible to retrieve only portions of the window's text by using ControlGetText instead.
ja: これを避けるために、代わりにControlGetTextを使うことで、ウィンドウのテキストの一部だけを取り出すことができるかもしません。

source: To avoid this, put an asterisk between the colon and handle.
ja: これを避けるには、コロンとハンドルの間にアスタリスクを入れる。

source: To avoid this, see the next option.
ja: これを回避するためには、次のオプションをご覧ください。

source: To avoid using a temporary file (especially if the output is large), consider using the Shell.Exec() method as shown in the examples for the Run function.
ja: 一時ファイルの使用を避けるには（特に出力が大きい場合）、Run関数の例にあるように、Shell.Exec()メソッドの使用を検討します。

source: To be a match, an image on the screen must be the same size as the one loaded via the ImageFile parameter and its options.
ja: 一致するためには、画面上の画像は、ImageFileパラメータとそのオプションで読み込まれた画像と同じサイズでなければなりません。

source: To be effective, the control's window generally must not be minimized or hidden.
ja: 効果的に使用するためには、一般的にコントロールのウィンドウは最小化または非表示になっていない必要があります。

source: To be effective, the window generally must not be minimized or hidden.
ja: 効果的に使用するためには、一般的にウィンドウを最小化または非表示にする必要はありません。

source: To be effective, this style must be set before any work areas are defined and any items have been added to the control.
ja: このスタイルを有効にするには、ワークエリアが定義され、コントロールにアイテムが追加される前に設定する必要がある。

source: To be sorted properly, each integer must be 32-bit; that is, within the range -2147483648 to 2147483647.
ja: 正しくソートするためには、各整数は32ビット、つまり-2147483648から2147483647の範囲内でなければなりません。

source: To bypass this End-of-Line translation, use GuiCtrl.Text.
ja: この行末変換を回避するためには、GuiCtrl.Textを使用します。

source: To calculate the amount of time between two timestamps, use DateDiff.
ja: 2つのタイムスタンプの間の時間量を計算するには、DateDiffを使用します。

source: To calculate the size of folder, including all its files, follow this example:
ja: すべてのファイルを含むフォルダのサイズを計算するには、次の例に従います：

source: To call a function when all you have is a function name (string), first use a double-deref to resolve the name to a variable and retrieve its value (the function object).
ja: 関数名（文字列）しかないときに関数を呼び出すには、まずdouble-derefで名前を変数に解決し、その値（関数オブジェクト）を取得します。

source: To call a function with one or more blank values (empty strings), use an empty pair of quotes as in this example:
ja: 1つ以上の空白の値（空文字列）を持つ関数を呼び出すには、この例のように空の引用符の組を使用します。

source: To call a function with one or more blank values (empty strings), use an empty pair of quotes as in this example: FindColor(ColorName, "").
ja: 1つ以上の空白の値（空文字列）を持つ関数を呼び出すには、この例のように空の引用符の組を使用します：FindColor(ColorName, "")。

source: To call a method, one must specify an object and a method name.
ja: メソッドを呼び出すには、オブジェクトとメソッド名を指定する必要があります。

source: To call the function, assign its result to a variable with the := operator.
ja: 関数を呼び出すには、その結果を:=演算子で変数に代入します。

source: To cancel the Alt-Tab menu without activating the selected window, press or send Esc.
ja: 選択したウィンドウをアクティブにせずにAlt-Tabメニューをキャンセルするには、Escを押すか送信してください。

source: To catch all events without defining a method for each one, define a __Call meta-function.
ja: イベントごとにメソッドを定義することなく、すべてのイベントをキャッチするには、__Callメタファンクションを定義します。

source: To catch anything at all, use Catch Any.
ja: 何でもかんでもキャッチする場合は、Catch Anyを使用します。

source: To catch anything at all, use catch Any.
ja: 何でもかんでもキャッチする場合は、catch Anyを使用します。

source: To center an Integer or Float column, specify the word Center after the word Integer or Float.
ja: IntegerまたはFloatの列をセンタリングするには、IntegerまたはFloatの後にCenterを指定します。

source: To change a window's existing TransColor, it may be necessary to turn off transparency before making the change.
ja: ウィンドウの既存のTransColorを変更するには、変更する前に透明度をオフにする必要があります。

source: To change an existing item's options without affecting its callback or submenu, simply omit the Callback-or-Submenu parameter.
ja: コールバックやサブメニューに影響を与えずに既存のアイテムのオプションを変更するには、Callback-or-Submenuパラメータを省略するだけです。

source: To change an existing item's options without affecting its callback or submenu, simply omit the CallbackOrSubmenu parameter.
ja: コールバックやサブメニューに影響を与えずに既存のアイテムのオプションを変更するには、CallbackOrSubmenuパラメータを省略するだけです。

source: To change how long the script will keep trying to open the clipboard -- such as when it is in use by another application -- use #ClipboardTimeout.
ja: クリップボードが他のアプリケーションで使用されている場合など、スクリプトがクリップボードを開こうとする時間を変更するには、#ClipboardTimeoutを使用します。

source: To change that, use SetWorkingDir at the top of the script.
ja: これを変更するには、スクリプトの先頭でSetWorkingDirを使用します。

source: To change the date/time being displayed, assign GuiCtrl.Value a date-time stamp in YYYYMMDDHH24MISS format.
ja: 表示される日時を変更するには、GuiCtrl.Valueに YYYYMMDDHH24MISS形式の日付-時刻スタンプを割り当てます。

source: To change the priority of an existing timer without affecting it in any other way, omit Period.
ja: 既存のタイマーの優先順位を変更する場合、他の方法で影響を与えることなく、Periodを省略します。

source: To change this behavior, add up one or both of the following digits:
ja: この動作を変更するには、以下の1桁または2桁を加算してください：

source: To change this behavior, specify one of the following letters:
ja: この動作を変更するには、次の文字のいずれかを指定します：

source: To change this behavior, specify one of the following words:
ja: この動作を変更するには、次のいずれかの単語を指定します。

source: To change this behavior, specify one or more of the following words:
ja: この動作を変更するには、以下の単語を1つ以上指定します：

source: To change this behavior, specify the following letter:
ja: この動作を変更するには、次の文字を指定します：

source: To check for y itself, call x.HasBase(y) or HasBase(x, y).
ja: yそのものを確認するには、x.HasBase(y)またはHasBase(x, y)を呼び出します。

source: To check for a specific relationship between the two strings, compare the result to 0.
ja: 2つの文字列間の特定の関係をチェックするには、結果を0と比較する。

source: To check for any type of object (that is, anything which is not a primitive value), use the IsObject function.
ja: あらゆるタイプのオブジェクト（つまり、プリミティブ値でないもの）をチェックするには、IsObject関数を使います。

source: To check for the latter, use DirExist.
ja: 後者を確認するには、DirExistを使用します。

source: To check if a particular attribute is present in the retrieved string, see example #2 below.
ja: 取得した文字列に特定の属性が存在するかどうかを確認するには、以下の例 #2をご覧ください。

source: To check if a value can be used as a number, use the IsNumber, IsInteger or IsFloat function.
ja: ある値が数値として使えるかどうかを調べるには、IsNumber関数、IsInteger関数、またはIsFloat関数を使います。

source: To check if a value is an instance of a specific class, use the is operator.
ja: 値が特定のクラスのインスタンスであるかどうかをチェックするには is演算子を使います。

source: To close (hide) the window without terminating the script, use WinHide.
ja: スクリプトを終了させずにウィンドウを閉じる（隠す）には、WinHideを使用します。

source: To combine multiple criteria, list the window title first.
ja: 複数の条件を組み合わせる場合は、ウィンドウのタイトルを最初に記載します。

source: To configure a script to start automatically after the user logs in, the easiest way is to place a shortcut to the script file in the Startup folder.
ja: ユーザーがログインした後にスクリプトが自動的に開始するように設定す るには、スクリプト ファイルへのショートカットをスタートアップフォルダに置くのが最も簡単な方法です。

source: To connect to a remote registry, use \\ComputerName\RootKey\Key instead of \\ComputerName:RootKey, Key.
ja: リモートレジストリに接続する場合は\\ComputerName\RootKey\Keyの代わりに、\\ComputerName\RootKey\Keyを使用します。

source: To connect to a remote registry, use \\ComputerName\RootKey\SubKey instead of \\ComputerName:RootKey, SubKey.
ja: リモートレジストリに接続する場合は\\ComputerName:RootKey, SubKeyの代わりに\\ComputerName\RootKey\SubKeyを使用します。

source: To construct an object based on another object that is not a class, create it with {} or Object() (or by any other means) and set its base.
ja: クラスではない別のオブジェクトを元にオブジェクトを構成するには、{}またはObject()で（あるいは他の手段で）作成し、そのbaseを設定します。

source: To contain a collection of items or elements.
ja: アイテムや要素のコレクションを含むこと。

source: To continue installation, select More info and then Run anyway.
ja: インストールを続けるには、「詳細情報」を選択し、「とにかく実行」を選択します。

source: To control how the file is decoded when no byte order mark is present, use FileEncoding.
ja: バイトオーダーマークが存在しない場合のファイルのデコード方法を制御するには、FileEncodingを使用します。

source: To convert a degrees value to radians, multiply it by pi/180 (approximately 0.01745329252).
ja: 度数値をラジアンに変換するには、π/180（約0.01745329252）を掛けます。

source: To convert a radians value to degrees, multiply it by 180/pi (approximately 57.29578).
ja: ラジアンの値を度数に変換するには、180/pi（約57.29578）を掛けます。

source: To convert an address to a proper reference, use the ObjFromPtr function:
ja: アドレスを適切な参照に変換するには、ObjFromPtr関数を使用します：
